site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Greedy Algorithms
:PROPERTIES:
:EXPORT_FILE_NAME: greedy_algorithms
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 6 :date 2022-08-22 :publishdate 2022-07-01
:ID:       536a6476-b1c4-4dd7-b720-44a06977ecf4
:END:


A Greedy Algorithm is a problem-solving approach that makes a locally optimal choice at each step.  There is a class of
problems where this approach also yields the globally optimum solution.

Classic examples include the coin change problem (under certain circumstances), activity selection, and certain
scheduling problems.

*** Slides
- [[/slides/greedy-algorithms.pdf][Greedy Algorithms Slides]]


