content/lectures/greedy_algorithms.md
+++
title = "Greedy Algorithms"
draft = false
weight = 6
date = 2022-08-22
publishdate = 2022-07-01
+++

A Greedy Algorithm is a problem-solving approach that makes a locally optimal choice at each step.  There is a class of
problems where this approach also yields the globally optimum solution.

Classic examples include the coin change problem (under certain circumstances), activity selection, and certain
scheduling problems.


## Slides {#slides}

-   [Greedy Algorithms Slides](/slides/greedy-algorithms.pdf)
